tutorials/incompressible/simpleFoam/ERCOFTAC_ConicalDiffuser/Case1.1/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 11.6);

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform (0 0 11.6);

    }

    outlet          
    {
        type            zeroGradient;
    }

    wallProlongation
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    wallDiffuser
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    statSwirlWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    rotSwirlWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* //
